In [1]:
import sqlite3
import pandas as pd

In [2]:
# create a connection to a database
db = sqlite3.connect('vegetables.db')

In [3]:
# create a cursor
cur = db.cursor()

In [4]:
step1 = cur.execute('CREATE TABLE IF NOT EXISTS vegetables (name TEXT, color TEXT, count INTEGER)')
step1.fetchall()

[]

In [5]:
cur.execute('INSERT INTO vegetables VALUES ("carrot", "orange", 10)')

In [6]:
step3 = cur.execute('SELECT * FROM vegetables')
step3.fetchall()

[('carrot', 'orange', 10)]

In [7]:
cur.execute('UPDATE vegetables SET count = 20 WHERE name = "carrot"')

In [8]:
cur.execute('INSERT INTO vegetables VALUES ("broccoli", "green", 15)')
cur.execute('INSERT INTO vegetables VALUES ("cauliflower", "white", 31)')
cur.execute('INSERT INTO vegetables VALUES ("zucchini", "green", 27)')
cur.execute('INSERT INTO vegetables VALUES ("spinach", "green", 4)')
cur.execute('INSERT INTO vegetables VALUES ("squash", "yellow", 4)')
cur.execute('INSERT INTO vegetables VALUES ("peas", "green", 3)')
cur.execute('INSERT INTO vegetables VALUES ("potato", "brown", 8)')
cur.execute('INSERT INTO vegetables VALUES ("tomato", "red", 9)')
cur.execute('INSERT INTO vegetables VALUES ("eggplant", "purple", 6)')
cur.execute('INSERT INTO vegetables VALUES ("cucumber", "green", 11)')
cur.execute('INSERT INTO vegetables VALUES ("celery", "green", 12)')
cur.execute('INSERT INTO vegetables VALUES ("asparagus", "green", 13)')
cur.execute('INSERT INTO vegetables VALUES ("garlic", "white", 14)')

In [9]:
step5 = cur.execute('SELECT * FROM vegetables')
step5.fetchall()

[('carrot', 'orange', 20),
 ('broccoli', 'green', 15),
 ('cauliflower', 'white', 31),
 ('zucchini', 'green', 27),
 ('spinach', 'green', 4),
 ('squash', 'yellow', 4),
 ('peas', 'green', 3),
 ('potato', 'brown', 8),
 ('tomato', 'red', 9),
 ('eggplant', 'purple', 6),
 ('cucumber', 'green', 11),
 ('celery', 'green', 12),
 ('asparagus', 'green', 13),
 ('garlic', 'white', 14)]

In [10]:
db.commit()

In [11]:
db.close()

## Section 2 Week 9
### I have selected a dataset from Kaggle: https://www.kaggle.com/datasets/shariful07/nice-work-thanks-for-share

In [11]:
# Connect to DB and create a cursor
sqliteConnection = sqlite3.connect("student.db")
cursor = sqliteConnection.cursor()

In [12]:
# create database/table

db = pd.read_csv('University Students Monthly Expenses.csv')
db.to_sql('student', sqliteConnection, if_exists='append', index=False)

105

In [13]:
db.head()

,Gender,Age,Study_year,Living,Scholarship,Part_time_job,Transporting,Smoking,Drinks,Games_&_Hobbies,Cosmetics_&_Self-care,Monthly_Subscription,Monthly_expenses_$
0,Female,21,2.0,Home,No,No,No,No,No,No,Yes,No,150.0
1,Male,25,3.0,Hostel,No,Yes,Motorcycle,No,No,Yes,Yes,Yes,220.0
2,Male,23,2.0,Home,Yes,No,No,No,No,No,No,NaN,180.0
3,Male,19,3.0,Hostel,No,No,Motorcycle,No,No,Yes,Yes,Yes,200.0
4,Female,19,2.0,Home,No,No,Motorcycle,No,No,No,Yes,No,300.0

In [24]:
max_spend = db.sort_values(by="Monthly_expenses_$", ascending=False)['Monthly_expenses_$'].iloc[0]
print(f"The maximum monthly spend is ${max_spend}.")

The maximum monthly spend is $350.0.

In [14]:
cursor.execute("select * from student")

In [15]:
# this will show the first row in the data
cursor.fetchone()

('Female ',
 21,
 2.0,
 'Home',
 'No',
 'No',
 'No',
 'No',
 'No',
 'No',
 'Yes',
 'No',
 150.0)

In [16]:
# show the columns in the database
print(db.columns)

Index(['Gender', 'Age', 'Study_year', 'Living', 'Scholarship', 'Part_time_job',
       'Transporting', 'Smoking', 'Drinks', 'Games_&_Hobbies',
       'Cosmetics_&_Self-care', 'Monthly_Subscription', 'Monthly_expenses_$'],
      dtype='object')

In [27]:
# select the student with monthly expenses greater than 200
cursor.execute("select * from student where Monthly_expenses_$ > 200")
rich = cursor.fetchall()
[i for i in rich][0]
print(f"There are {len(rich)} students with monthly expenses greater than $200.")

There are 38 students with monthly expenses greater than $200.

In [30]:
# select the student with monthly expenses less than 100
cursor.execute("select Scholarship,Part_time_job from student where Monthly_expenses_$ < 150")
spd_less = cursor.fetchall()
[i for i in spd_less][0]
print(f"There are {len(spd_less)} students with monthly expenses less than $150.")

There are 5 students with monthly expenses less than $150.

In [31]:
print(spd_less)

[('No', 'No'), ('No', 'No'), ('No', 'No'), ('No', 'No'), ('No', 'No')]